package com.buammar;

public class تشغيل {
    public static void main(String[] args) {
        الدلة شاي = new الدلة("شاي", 1200, 40);
        شاي.تقديم_كامل_الدلة();
        شاي.كمية_السائل_في_الدلة();
        الدلة قهوة = new الدلة("قهوة", 400, 20);
        قهوة.تقديم(100);
        قهوة.كمية_السائل_في_الدلة();
        قهوة.تعبئة();
        الدلة عصير = new الدلة("عصير", 5000, 100);
        عصير.تقديم(100);
        عصير.كمية_السائل_في_الدلة();
        عصير.تنظيف_الدلة();
        عصير.تعبئة(0.1);
        الدلة حليب = new الدلة("حليب", 5500, 10);
        حليب.تعبئة();
    }
}
