package net.buammar;

/**
 * @author Yasir Albardawil
 */

public class الدلة {
    private String نوع_السائل;
    private  final double كمية_السائل_في_الكأس;
    private final double حجم_الكأس;
    private double حجم_السائل;


    public الدلة(String نوع_السائل, double حجم_الدلة, double كمية_السائل) {
        this.نوع_السائل = نوع_السائل;
        كمية_السائل_في_الكأس = حجم_الدلة;
        حجم_الكأس = كمية_السائل;
        حجم_السائل = كمية_السائل_في_الكأس;
	
        System.out.println("--------------------[دلة ال" + نوع_السائل + "]--------------------");
    }


    public void تعبئة() {
        تعبئة(كمية_السائل_في_الكأس-حجم_السائل);
    }


    public void تعبئة(double كمية_السائل) {
        if (حجم_السائل > 0) {
            double السائل_الجديد = حجم_السائل + كمية_السائل;
            if (السائل_الجديد <= كمية_السائل_في_الكأس) {
                this.حجم_السائل = السائل_الجديد;
                System.out.println("تم إضافة " + حجم_السائل + " لتر من ال" + نوع_السائل);
            } else {
                System.out.println("دلة ال" + نوع_السائل + " زائدة بمقدار " + (السائل_الجديد-كمية_السائل_في_الكأس) + " لتر لا يمكنك الإضافة.  يجب أن تنقص " + (السائل_الجديد-كمية_السائل_في_الكأس) + " لتر من ال" + نوع_السائل);
            }
        } else {
            System.out.println("يجب أن يكون حجم السائل لل" + نوع_السائل + "أكبر من 0");
        }

    }


    public void تقديم(int عدد_مرات_التقديم) {
        double عد =  عدد_الكؤوس();
        if (عدد_مرات_التقديم > 0) {
            for (int i =0; i < عد; i++) {
                if (!هل_فارغ()) {
                    if (عدد_الكؤوس() >= 1) {
                        System.out.println("تقديم القليل من ال" + نوع_السائل + " " + حجم_السائل + " لتر [-"+حجم_الكأس+" لتر]");
                        حجم_السائل -= حجم_الكأس;
                    }
                } else {
                    System.out.println("دلة ال" + نوع_السائل + " فارغة");
                }
            }
        } else {
            System.out.println("يجب أن يكون حجم السائل لل" + نوع_السائل + "أكبر من 0");
        }
        getlastLiquidAmount();
    }


    public void تقديم(int عدد_مرات_التقديم, double كمية_السائل) {
        if (عدد_الكؤوس() >= عدد_مرات_التقديم) {
            for (int i = 0; i < عدد_مرات_التقديم; i++) {
                if (!هل_فارغ()) {
                    if (حجم_السائل >= كمية_السائل) {
                        System.out.println("تقديم القليل من ال" + نوع_السائل + " " + حجم_السائل + " لتر [-"+كمية_السائل+" لتر]");
                        حجم_السائل -= كمية_السائل;
                    }
                } else {
                    System.out.println("دلة ال" + نوع_السائل + " فارغة");
                }
            }
        } else {
            getlastLiquidAmount();
        }

    }


    public void تقديم_كامل_الدلة() {
        while (عدد_الكؤوس() >= 1) {
            System.out.println("تقديم القليل من ال" + نوع_السائل + " " + حجم_السائل + " لتر [-"+حجم_الكأس+" لتر]");
            حجم_السائل -= حجم_الكأس;

        }

        getlastLiquidAmount();
    }

    private double عدد_الكؤوس() {
        return حجم_السائل/حجم_الكأس;
    }


    private void getlastLiquidAmount() {
        if ((حجم_السائل < حجم_الكأس) && حجم_السائل > 0) {
            System.out.println("تقديم القليل من ال" + نوع_السائل + " " + حجم_السائل + " [-"+حجم_السائل+" لتر]");
            حجم_السائل = حجم_السائل - حجم_السائل;
        }
    }


    private boolean هل_فارغ() {
        return حجم_السائل == 0;
    }

    public void كمية_السائل_في_الدلة() {
        if (حجم_السائل > 0) {
            System.out.println("لديك دلة تحتلوي على " + حجم_السائل + " لتر من ال" + نوع_السائل);
        } else {
            System.out.println("دلة ال" + نوع_السائل + " فارغة");
        }
    }


    public void تنظيف_الدلة() {
        if (هل_فارغ()) {
            System.out.println("تم غسل دلة ال" + نوع_السائل);
        }
    }
}
